--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    preserver

    根据食物的 perishable 可腐烂模块的 Update 算法进行修改。
]]--
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

return function(inst)
    if not TheWorld.ismastersim then
        return
    end

    inst:AddTag("spoiler")
    inst:AddComponent("preserver")
    inst.components.preserver:SetPerishRateMultiplier(1)
    
end