--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--[[

    鞋子 T1 - T9 

    每一级都有上一级的功能。




    相关API:


    1：免疫钢羊的控制效果

    2：免疫冰冻，半径30码内所有玩家获得15%减伤

    3：金卡权重+5，彩卡权重+0.5，移动速度+10%

    4：免疫精神控制（织影者那种），免疫催眠

    5：半径30码内所有玩家基础攻击伤害+20%，且每次攻击恢复5点san值（启蒙状态改为降低5启蒙值）

    6：每次造成伤害都会 额外 直接扣除敌人最大生命值1%的。每有一个诅咒效果，基础攻击伤害增加50%。

    7：半径30码内的枯萎植物会恢复，半径30码内的玩家会每10s恢复3点生命值

    8：每次睡觉时获得一包升级卡包，此效果每一天仅可触发1次。

    9：每次攻击会恢复造成伤害1%的生命值，被攻击到的生物获得debuff：受到的最终伤害增加100%，持续10s。

]]--
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------


--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
return function(inst)
    inst.level = math.clamp(inst.level or 1,1,9)

    ----------------------------------------------------------------------------------
    --- 免疫钢羊鼻涕的控制效果
        if inst.level >= 1 then
            local sg_state = {
                ["pinned_hit"] = true,
                ["pinned"] = true,
                ["pinned_pre"] = true,
            }
            local player_pinned_block_state_event_fn = function(player,_table)
                local statename = _table and _table.statename
                if sg_state[statename] then
                    player.sg:GoToState("idle")
                end
            end
            inst:ListenForEvent("Special_Fn_Active",function(inst,owner)
                inst:ListenForEvent("newstate",player_pinned_block_state_event_fn,owner)
            end)
            inst:ListenForEvent("Special_Fn_Deactive",function(inst,owner)
                inst:RemoveEventCallback("newstate",player_pinned_block_state_event_fn,owner)
            end)
        end
    ----------------------------------------------------------------------------------
end