---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
--- 统一注册 【 images\map_icons 】 里的所有图标
--- 每个 xml 里面 只有一个 tex

---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

if Assets == nil then
    Assets = {}
end

local files_name = {
	-------------------------------------------------------------------------------------------------
	---- 00_hoshino_others
	---- 22_hoshino_npc
	-------------------------------------------------------------------------------------------------
		"hoshino",						--- 小地图图标
	-------------------------------------------------------------------------------------------------
	---- 06_buildings
		"hoshino_building_shop24",								--- 24小时商店
		"hoshino_building_ether_pool",							--- 以太池
	-------------------------------------------------------------------------------------------------
	---- 09_hoshino_tasks
		"hoshino_building_task_board",							--- 任务公告栏
		"hoshino_building_shiba_seki_ramen_cart_map",			--- 柴关拉面店
		"hoshino_building_shiba_seki_ramen_cart",				--- 柴关拉面店
	-------------------------------------------------------------------------------------------------

}

for k, name in pairs(files_name) do
    table.insert(Assets, Asset( "IMAGE", "images/map_icons/".. name ..".tex" ))
    table.insert(Assets, Asset( "ATLAS", "images/map_icons/".. name ..".xml" ))
	AddMinimapAtlas("images/map_icons/".. name ..".xml")
	RegisterInventoryItemAtlas("images/map_icons/".. name ..".xml",name..".tex")	
end


